{
    "global_intro": {
        "title": "El Santo Rosario",
        "theological_foundation": "El Santo Rosario, en su estructura actual, es fundamentalmente un método de oración contemplativa centrada en la vida, pasión y glorificación de Jesucristo. La adición de los Misterios de la Luz (Luminosos) por parte de San Juan Pablo II fue una decisión doctrinal clave, destinada a acentuar el carácter cristológico de la devoción.",
        "gospel_compendium": "La secuencia de los misterios (Gozo, Luz, Dolor y Gloria) constituye una arquitectura redentora que guía al creyente a través de la economía de la salvación. Este recorrido progresivo no solo narra la historia evangélica, sino que también vincula la meditación de los eventos con la adquisición de virtudes específicas."
    },
    "mysteries": [
        {
            "mystery_name": "Misterios Gozosos",
            "mystery_number": 1,
            "title": "La Anunciación",
            "meaning": "El Arcángel Gabriel anuncia a la Virgen María que concebirá al Hijo del Altísimo. Con su 'Fiat', María acepta la voluntad divina y el Verbo se hace carne.[1]",
            "scripture_primary": "Luke 1:26-38",
            "scripture_secondary": "Isaiah 7:14",
            "fruit": "Humildad",
            "fruit_explanation": "La humildad de corazón que se somete a Dios. María se reconoce como la 'esclava del Señor', vaciándose de sí misma para llenarse de Dios.[2]",
            "life_application": "Practicar la obediencia radical a la voluntad de Dios en las tareas diarias, despojándose de la propia voluntad e imitando la disponibilidad total de María.[3]",
            "meditation": "Contemplar la fe inquebrantable de María y su asombro. Reflexionar sobre las barreras y dudas que interponen nuestro 'no' a los planes de Dios. Pedir una fe sencilla y obediente.[3, 4]",
            "deeper_theology": "El misterio central de la **Unión Hipostática** (la unión de la naturaleza divina y humana en Cristo).[4] María es la *Theotokos* (Madre de Dios) y Su obediencia es el inicio de la Nueva Alianza.",
            "historical_context": "La Anunciación marca la **plenitud de los tiempos**, cumpliendo las profecías del Antiguo Testamento. Ocurre en Nazaret, un lugar humilde, destacando la predilección de Dios por los pequeños.",
            "mary_and_christ_role": "Cristo se encarna en el vientre virginal por el Espíritu Santo. María es la Madre de Dios y el primer tabernáculo vivo, cuyo 'sí' es la condición humana para la Redención.",
            "virtue_formation": "Obediencia a la Palabra"
        },
        {
            "mystery_name": "Misterios Gozosos",
            "mystery_number": 2,
            "title": "La Visitación de Nuestra Señora",
            "meaning": "María, ya portadora de Cristo, viaja con prontitud para servir a su prima Isabel, que está embarazada. En Su presencia, Juan el Bautista es santificado en el vientre de Isabel, y esta proclama a María 'Bendita entre las mujeres'.[4]",
            "scripture_primary": "Luke 1:39-56",
            "scripture_secondary": "Luke 1:46-48",
            "fruit": "Caridad Fraterna",
            "fruit_explanation": "El amor activo y desinteresado por el prójimo, que se traduce en servicio. María supera las dificultades del viaje por amor, demostrando que la fe se manifiesta en el servicio.[1, 4]",
            "life_application": "Priorizar el servicio al prójimo y la caridad activa en la vida diaria. Reflexionar sobre cómo podemos llevar la presencia de Cristo a otros a través de actos de amor simple.[3]",
            "meditation": "Contemplar la alegría que María lleva consigo. Meditar sobre cómo somos portadores de Cristo y de Su gracia a los demás, especialmente a los necesitados, a través de nuestra prontitud en el servicio.",
            "deeper_theology": "La **Mediación de la Presencia** de Cristo. María es la primera evangelista que lleva a Cristo, cuya presencia santifica a Juan. El *Magnificat* es un cántico que afirma la justicia y misericordia de Dios.",
            "historical_context": "El viaje, largo y difícil, subraya la urgencia de la caridad cristiana, que trasciende la comodidad personal. Subraya la unión entre el Antiguo y el Nuevo Pacto (Juan e Isabel con Jesús y María).",
            "mary_and_christ_role": "Cristo actúa santificando a Juan Bautista desde el vientre. María es la 'Arca de la Nueva Alianza', modelo de la evangelización caritativa y de la prontitud en el servicio.",
            "virtue_formation": "Prontitud en el Servicio"
        },
        {
            "mystery_name": "Misterios Gozosos",
            "mystery_number": 3,
            "title": "El Nacimiento de Jesús en Belén",
            "meaning": "Jesús nace en un pesebre debido a la pobreza extrema y al rechazo humano. Este misterio es la revelación de la *Kenosis* (el vaciamiento) de Cristo. La pobreza de Belén es la prefiguración de la desnudez en el Calvario.[7]",
            "scripture_primary": "Luke 2:1-20",
            "scripture_secondary": "2 Corinthians 8:9",
            "fruit": "Pobreza de Espíritu",
            "fruit_explanation": "El desprendimiento interior de los bienes materiales y la confianza absoluta en la providencia de Dios. Es aceptar la incomodidad con gozo.[1, 3]",
            "life_application": "Aceptar la incomodidad y vivir el desprendimiento material, priorizando lo eterno sobre lo terrenal y viviendo con gratitud ante las bendiciones recibidas.[3]",
            "meditation": "Contemplar la fragilidad y vulnerabilidad del Niño Jesús. Reflexionar sobre cómo el mundo aún le cierra las puertas hoy. Pedir que el corazón se ablande para hacer espacio a Cristo.[1]",
            "deeper_theology": "La *Kenosis* o 'vaciamiento' de Cristo. La pobreza de Belén es la prefiguración de la Pasión, anticipando el despojo total que ocurrirá en la Cruz. Dios se revela en la debilidad.",
            "historical_context": "El censo ordenado por César Augusto obligó a José y María a viajar a Belén. El nacimiento se produce en el contexto de la ocupación romana, pero la salvación llega de forma discreta y humilde.",
            "mary_and_christ_role": "Cristo se manifiesta como el Mesías humilde. María lo da a luz en la pobreza, envolviéndolo en pañales y contemplando en silencio el misterio de la Encarnación.",
            "virtue_formation": "Desprendimiento Material"
        },
        {
            "mystery_name": "Misterios Gozosos",
            "mystery_number": 4,
            "title": "La Presentación del Señor en el Templo",
            "meaning": "María y José presentan a Jesús en el Templo para cumplir la Ley. Simeón profetiza que una 'espada' traspasará el alma de María. Este evento es la **Primera Ofrenda Sacerdotal** y el inicio de la *Compassio* de María.[8]",
            "scripture_primary": "Luke 2:22-38",
            "scripture_secondary": "Exodus 13:2",
            "fruit": "Pureza y Obediencia",
            "fruit_explanation": "La pureza de intención que busca solo la gloria de Dios y la obediencia fiel a los preceptos divinos, asumiendo que la fe implica sacrificio.[3]",
            "life_application": "Vivir la pureza de intención en el trabajo y en las relaciones. Obedecer los preceptos de la fe, asumiendo que la fe siempre implica un sacrificio personal.[1]",
            "meditation": "Contemplar el sacrificio de la ofrenda y la profecía de Simeón. Meditar sobre la *Compassio* de María, cuya alegría inicial es inmediatamente marcada por la sombra de la Cruz.",
            "deeper_theology": "La **Primera Ofrenda Sacerdotal** de Jesús y la aceptación del sufrimiento por parte de María. El misterio introduce el dolor en la infancia de Cristo, vinculando desde el inicio Su vida con Su sacrificio final.",
            "historical_context": "Cumplimiento del precepto levítico de la purificación y la redención del primogénito. Este rito, aunque simbólico para la Sagrada Familia, subraya la humanidad y la sumisión de Jesús a la Ley.",
            "mary_and_christ_role": "Cristo es ofrecido al Padre como sacrificio. María es la Madre obediente que se somete a la Ley y acepta la espada de dolor que le profetiza Simeón.",
            "virtue_formation": "Pureza de Intención"
        },
        {
            "mystery_name": "Misterios Gozosos",
            "mystery_number": 5,
            "title": "El Niño Jesús Perdido y Hallado en el Templo",
            "meaning": "Jesús se queda en el Templo conversando con los doctores. Tras tres días de búsqueda, es hallado, declarando que debe ocuparse de los asuntos del Padre. Es un **Preámbulo Pascual**.[9]",
            "scripture_primary": "Luke 2:41-52",
            "scripture_secondary": "Psalm 42:1-2",
            "fruit": "Búsqueda de Cristo",
            "fruit_explanation": "La perseverancia en la búsqueda de Dios y el amor ardiente por Su voluntad. Es aceptar los momentos de 'oscuridad' sabiendo que Cristo está en la casa del Padre.[3]",
            "life_application": "Aceptar los momentos de 'oscuridad' o sequedad espiritual con la certeza de que Cristo siempre está presente en 'la casa del Padre'.[9] Priorizar el Reino de Dios sobre los intereses personales.",
            "meditation": "Meditar la angustia de los tres días de pérdida, que prefiguran la Pasión. Reflexionar sobre la necesidad de poner la voluntad de Dios en el centro de nuestra vida, abandonando todo apego innecesario.",
            "deeper_theology": "El **Preámbulo Pascual**. Los tres días de pérdida prefiguran los tres días de sepultura. Jesús revela Su conciencia de la misión divina, afirmando Su deidad y Su vocación por encima de Sus obligaciones terrenales.",
            "historical_context": "La peregrinación a Jerusalén para la Pascua era obligatoria. El episodio muestra el desarrollo humano y la conciencia divina de Jesús, preparándolo para Su ministerio público.",
            "mary_and_christ_role": "Cristo, con doce años, revela Su conciencia filial. María y José representan a la Iglesia que busca a Cristo con dolor, hallándolo en la Palabra y en la oración.",
            "virtue_formation": "Celó por la Gloria de Dios"
        },
        {
            "mystery_name": "Misterios Luminosos",
            "mystery_number": 1,
            "title": "La Epifanía Trinitaria",
            "meaning": "Jesús es bautizado por Juan el Bautista, no por necesidad de purificación, sino para 'cumplir toda justicia'. Al salir del agua, el Padre lo proclama Hijo Amado, y el Espíritu Santo desciende en forma de paloma.",
            "scripture_primary": "Matthew 3:13-17",
            "scripture_secondary": "Mark 1:9-11",
            "fruit": "Gracia de Hijos de Dios",
            "fruit_explanation": "Este fruto es la plena asunción de la dignidad de ser hijo de Dios, reconociendo el sello indeleble del Bautismo que nos incorpora a la vida de Cristo y a la Iglesia.",
            "life_application": "Vivir con el celo apostólico, buscando que el mundo arda con el fuego de la verdad de Cristo. Asumir la responsabilidad de la dignidad bautismal, que nos llama a la santidad.",
            "meditation": "Contemplar la manifestación de la Santísima Trinidad. Reflexionar sobre el propio bautismo y la promesa de que somos 'hijos amados' de Dios. Pedir la gracia de vivir siempre bajo la guía del Espíritu Santo.",
            "deeper_theology": "La **Epifanía Trinitaria**. Jesús santifica el agua del Bautismo, instituyendo este sacramento. Su acto es un gesto de obediencia que sella el inicio de Su misión pública.",
            "historical_context": "El bautismo de Juan era un rito de penitencia y conversión. Al someterse a él, Jesús se solidariza con la humanidad pecadora que venía a redimir.",
            "mary_and_christ_role": "Cristo es el Hijo amado y Mesías ungido. María, aunque no está físicamente presente, acompaña el inicio del ministerio de Su Hijo como 'Discípula perfecta'.",
            "virtue_formation": "Asunción de la Dignidad"
        },
        {
            "mystery_name": "Misterios Luminosos",
            "mystery_number": 2,
            "title": "Mediación Mariana y la Gracia Abundante",
            "meaning": "A petición de Su Madre, Jesús realiza Su primer milagro público, transformando el agua en vino. Este 'signo' manifestó Su gloria e hizo que Sus discípulos creyeran en Él.",
            "scripture_primary": "John 2:1-11",
            "scripture_secondary": "Genesis 2:24",
            "fruit": "Confianza en María",
            "fruit_explanation": "El fruto es la fe firme en el poder intercesor de María y la convicción de que Dios manifiesta Su grandeza a través de lo ordinario de la vida.",
            "life_application": "Acudir a María con confianza en las necesidades diarias. Integrar la fe en los detalles pequeños y corrientes de la vida, buscando la santificación en las tareas cotidianas.",
            "meditation": "Contemplar la atención solícita de María (advierte que falta el vino 'Ella sola, y en seguida').[11] Reflexionar en Su mandato a los sirvientes: 'Haced lo que él os diga', aplicándolo a nuestra vida de fe.",
            "deeper_theology": "La **Mediación Mariana de Gracia**. María, con Su intercesión, anticipa la 'hora' de Jesús. El vino nuevo simboliza la Gracia abundante de la Nueva Alianza y el don futuro de la Eucaristía.",
            "historical_context": "Las bodas en la cultura judía eran eventos sociales cruciales. El milagro es un signo mesiánico de abundancia y alegría (el vino nuevo) que marca el inicio de la vida pública.",
            "mary_and_christ_role": "Cristo revela Su gloria, haciendo creer a Sus discípulos. María es la Intercesora atenta que facilita el inicio de Su manifestación pública, demostrando que Su rol maternal es fundamental en la economía de la salvación.",
            "virtue_formation": "Santificación de lo Ordinario"
        },
        {
            "mystery_name": "Misterios Luminosos",
            "mystery_number": 3,
            "title": "Llamado a la Conversión y Misión",
            "meaning": "Jesús recorre Galilea, predicando el Evangelio y llamando a todos a la conversión, diciendo que el Reino de Dios ya está cerca. Este ministerio incluyó la invitación a los primeros discípulos a ser 'pescadores de hombres'.",
            "scripture_primary": "Mark 1:14-15",
            "scripture_secondary": "Luke 17:21",
            "fruit": "Conversión y Fe Apostólica",
            "fruit_explanation": "El fruto es la renovación constante de la vida espiritual, buscando que Cristo reine 'hasta el último latido' del alma [11], y la valentía para llevar el Evangelio a los demás.",
            "life_application": "Revisar la propia vida y buscar la metanoia (cambio de mentalidad). Practicar el 'Duc in altum' (¡Mar adentro!) en la misión, rechazando el pesimismo que obstaculiza la evangelización.",
            "meditation": "Meditar la urgencia del mensaje de Jesús: 'El tiempo se ha cumplido'. Reflexionar sobre la llamada a seguirlo y cómo hacer que el Reino de Dios, que ya está dentro de nosotros, se manifieste externamente.",
            "deeper_theology": "El **Reino Inmanente y Trascendente**. Cristo establece que Su Reino no es terrenal, sino espiritual, y se encuentra en el corazón del creyente. Es un llamado a una fe activa y una misión constante.",
            "historical_context": "Este periodo sigue al arresto de Juan el Bautista. Jesús asume el relevo de la predicación de la penitencia, transformándola en el anuncio activo de la 'Buena Noticia'.",
            "mary_and_christ_role": "Cristo es el Rey que proclama Su Reino y llama a los apóstoles. María es el modelo de la Iglesia que escucha y obedece, la primera en creer en la Buena Nueva.",
            "virtue_formation": "Valentía (Duc in Altum)"
        },
        {
            "mystery_name": "Misterios Luminosos",
            "mystery_number": 4,
            "title": "La Visión Anticipada de la Gloria",
            "meaning": "Jesús se transfigura en el Monte Tabor ante Pedro, Santiago y Juan, mostrando Su gloria divina y conversando con Moisés y Elías. Una nube los cubrió y la voz del Padre resonó: 'Este es mi Hijo, el amado; escuchadle'.",
            "scripture_primary": "Matthew 17:1-8",
            "scripture_secondary": "Luke 9:35",
            "fruit": "Esperanza en la Gloria",
            "fruit_explanation": "La esperanza es la virtud que nos mantiene enfocados en el destino celestial, permitiéndonos ver la gloria detrás del sufrimiento. Es la certeza de la resurrección.",
            "life_application": "Recordar el 'Tabor en los momentos de Getsemaní'.[12] Utilizar la promesa de la gloria futura como motor para la perseverancia y el servicio, permitiendo que el amor transfigure la vida.",
            "meditation": "Contemplar la luminosidad de Cristo. Meditar que la gloria siempre precede a la Pasión (es una gracia preventiva). Escuchar la voz del Padre que nos ordena 'escucharle', es decir, obedecer Su Palabra.",
            "deeper_theology": "**Tabor para Getsemaní**. La Transfiguración es una gracia dada a los apóstoles para que no se escandalizaran de la Pasión. Afirma el cumplimiento de la Ley (Moisés) y los Profetas (Elías) en Cristo.",
            "historical_context": "Sucede poco antes de que Jesús emprenda Su camino final hacia Jerusalén y Su Pasión. El misterio tiene lugar en un monte alto, simbolizando la cercanía a Dios.",
            "mary_and_christ_role": "Cristo manifiesta Su divinidad velada. María, aunque ausente, acompaña a Su Hijo con Su fe, siendo ella misma 'más brillante que el sol' en Fátima [6], un signo de la gloria que espera a los fieles.",
            "virtue_formation": "Perseverancia en la Prueba"
        },
        {
            "mystery_name": "Misterios Luminosos",
            "mystery_number": 5,
            "title": "El Pan de Vida y el Sacrificio Incruento",
            "meaning": "Durante la Última Cena, Jesús tomó pan y vino, los bendijo y los dio a Sus discípulos como Su Cuerpo y Su Sangre, ordenándoles hacer esto en memoria Suya. Instituyó el Sacramento del Orden y la Eucaristía.",
            "scripture_primary": "Matthew 26:26-29",
            "scripture_secondary": "1 Corinthians 11:23-26",
            "fruit": "Amor a la Eucaristía",
            "fruit_explanation": "El fruto es la profunda devoción a la Presencia Real de Cristo en el Santísimo Sacramento y el celo por la Adoración Eucarística.",
            "life_application": "Hacer de la propia vida una 'Eucaristía para los demás', viviendo la donación y la caridad sacrificial. Buscar siempre la Presencia Real como fuente de sentido y Pan de vida.[12]",
            "meditation": "Contemplar el inmenso amor que lleva a Cristo a permanecer con nosotros. Reflexionar sobre la verdad del sacrificio incruento que se actualiza en cada misa. Pedir la gracia de la fe para reconocer el Cuerpo y la Sangre de Cristo.",
            "deeper_theology": "La **Presencia Real** (Transubstanciación). La Eucaristía es el memorial del sacrificio del Calvario y el anticipo de la resurrección. Es el centro y la cumbre de toda la vida cristiana.",
            "historical_context": "La Última Cena se celebra en el contexto de la Pascua judía. Jesús da a la cena un nuevo significado, transformando el rito de la liberación de Egipto en el rito de la liberación del pecado por Su propia sangre.",
            "mary_and_christ_role": "Cristo es el Sacerdote Eterno que se ofrece a Sí mismo. María es el modelo de la adoración y la fe, la Madre que acompañó espiritualmente el Sacrificio desde el Cenáculo hasta el Calvario.",
            "virtue_formation": "Caridad Sacrificial"
        },
        {
            "mystery_name": "Misterios Dolorosos",
            "mystery_number": 1,
            "title": "Conformidad a la Voluntad Divina",
            "meaning": "Jesús se retira a Getsemaní antes de Su Pasión y, ante la angustia por el peso de los pecados de la humanidad, ora al Padre, pidiendo que pase de Él ese cáliz, pero sometiendo Su voluntad a la de Dios.",
            "scripture_primary": "Matthew 26:36-46",
            "scripture_secondary": "Hebrews 5:7-9",
            "fruit": "Contrición / Conformidad",
            "fruit_explanation": "El fruto es el dolor sincero por los propios pecados (contrición) y la aceptación de la voluntad de Dios, incluso en medio del miedo y el sufrimiento.",
            "life_application": "Aceptar la 'copa' del sufrimiento con confianza. Practicar la vigilancia y la oración constante para no caer en tentación, especialmente en momentos de prueba y desolación.",
            "meditation": "Contemplar el sufrimiento psicológico y moral de Jesús ante el conocimiento de la Pasión y la traición. Reflexionar sobre la diferencia entre la oración ferviente de Cristo y el sueño de Sus discípulos.",
            "deeper_theology": "**Conformidad de Voluntades**. Jesús, verdadero Dios y verdadero Hombre, acepta voluntariamente el sufrimiento redentor. Su obediencia repara la desobediencia de Adán.",
            "historical_context": "Getsemaní (prensa de aceite) es el lugar de la agonía y la traición de Judas. Simboliza el inicio de la Pasión, donde el sufrimiento moral es tan grande como el físico.",
            "mary_and_christ_role": "Cristo, el Redentor, se somete al plan divino. María, aunque ausente físicamente, comparte espiritualmente la angustia de Su Hijo a través de Su *Compassio*.",
            "virtue_formation": "Aceptación del Sufrimiento"
        },
        {
            "mystery_name": "Misterios Dolorosos",
            "mystery_number": 2,
            "title": "Expiación por la Impureza",
            "meaning": "Jesús es atado a la columna y azotado brutalmente por orden de Poncio Pilato. Sus heridas son el precio de nuestra curación y redención, mostrando la malicia del pecado y el dolor de Su inocencia.",
            "scripture_primary": "Matthew 27:26",
            "scripture_secondary": "Isaiah 53:5",
            "fruit": "Pureza / Mortificación",
            "fruit_explanation": "El fruto es la castidad y el dominio de las pasiones, obtenidos al ofrecer nuestras propias mortificaciones y sacrificios en unión con los sufrimientos de Cristo.",
            "life_application": "Practicar la templanza y la mortificación personal. Ofrecer pequeños dolores, humillaciones e incomodidades por la purificación del alma y en reparación por los pecados de la carne.",
            "meditation": "Contemplar la dignidad y la paciencia de Jesús bajo el látigo. Meditar cómo cada latigazo expía los pecados de la impureza. Pedir la gracia de la fortaleza ante las tentaciones de la carne.",
            "deeper_theology": "**Satisfacción Vicaria por la Impureza**. Las llagas de Cristo son la manifestación de Su amor y el medio por el cual obtenemos la sanación. Su cuerpo inmaculado paga por la lujuria del mundo.",
            "historical_context": "La flagelación (o *fustigatio*) era un castigo romano extremadamente brutal, a menudo mortal, utilizado para disuadir a las masas.",
            "mary_and_christ_role": "Cristo se ofrece como Víctima perfecta. María ofrece espiritualmente este sufrimiento de Su Hijo por la salvación de la humanidad.",
            "virtue_formation": "Dominio de las Pasiones"
        },
        {
            "mystery_name": "Misterios Dolorosos",
            "mystery_number": 3,
            "title": "Reparación de la Soberbia",
            "meaning": "Los soldados se burlan de Jesús, vistiéndole de púrpura, poniéndole una corona de espinas en la cabeza y aclamándole irónicamente como 'Rey de los judíos', en un acto de extrema humillación.",
            "scripture_primary": "Matthew 27:27-31",
            "scripture_secondary": "John 19:14-15",
            "fruit": "Humildad Interior",
            "fruit_explanation": "La humildad interior es la virtud que nos permite reconocer nuestras faltas y resistir la vanidad, la soberbia y el deseo de honores mundanos.",
            "life_application": "Cultivar la mansedumbre y la paciencia ante las críticas, el desprecio o la burla. Resistir el respeto humano y las vanidades del mundo.",
            "meditation": "Contemplar la dignidad de Cristo, Rey universal, sometido a la mayor humillación. Reflexionar sobre la propia sed de vanagloria y pedir perdón por la soberbia del corazón.",
            "deeper_theology": "**Reparación de la Soberbia**. La humillación de la realeza terrenal de Cristo repara el orgullo de la humanidad, que quiere ser rey sin someterse a Dios. La corona de espinas es el trono del verdadero rey.",
            "historical_context": "La burla se realiza en el Pretorio (sede de Pilato) y está diseñada para ser una forma de tortura psicológica y escarnio público, propia del sadismo romano.",
            "mary_and_christ_role": "Cristo sufre la humillación total por amor. María sufre el oprobio y el deshonor infligido a Su Hijo, un dolor que traspasa Su Corazón.",
            "virtue_formation": "Mansedumbre ante la Burla"
        },
        {
            "mystery_name": "Misterios Dolorosos",
            "mystery_number": 4,
            "title": "La Vocación a la Co-redención",
            "meaning": "Jesús es obligado a cargar la pesada Cruz camino del Calvario. Cae bajo el peso de nuestros pecados, y Simón de Cirene es obligado a ayudarlo, simbolizando la vocación de todo cristiano a cargar su propia cruz diaria.",
            "scripture_primary": "Mark 15:20-22",
            "scripture_secondary": "Luke 14:27",
            "fruit": "Paciencia / Aceptación",
            "fruit_explanation": "El fruto es la fortaleza y la paciencia para aceptar las dificultades y tribulaciones cotidianas, uniéndolas al sacrificio de Cristo.",
            "life_application": "Aceptar las cruces diarias (enfermedad, trabajo difícil, relaciones tensas) con paciencia y generosidad. Ayudar a los demás a llevar sus cargas (caridad).",
            "meditation": "Contemplar las caídas de Jesús y el doloroso encuentro con Su Madre en la Vía Dolorosa. Meditar que la cruz se lleva con el peso de los pecados de todo el mundo. Pedir la gracia de no huir del sufrimiento redentor.",
            "deeper_theology": "La **Co-redención Humana**. La ayuda de Simón de Cirene simboliza la colaboración del hombre en el sufrimiento. La *Compassio* de María se manifiesta en el camino, compartiendo el dolor de Su Hijo.",
            "historical_context": "El *patibulum* (madero horizontal) era cargado por el condenado, a menudo tras haber sido despojado de sus ropas y golpeado, exponiéndolo a la mofa pública antes de la crucifixión.",
            "mary_and_christ_role": "Cristo asume el castigo. María es la Madre que sufre en el alma el dolor físico y moral de Su Hijo, ejerciendo una compasión única en el camino de la Cruz.",
            "virtue_formation": "Fortaleza en las Dificultades"
        },
        {
            "mystery_name": "Misterios Dolorosos",
            "mystery_number": 5,
            "title": "Consumación del Sacrificio y Maternidad Universal",
            "meaning": "Jesús es clavado en la Cruz y muere después de tres horas de agonía, pronunciando las Siete Palabras. El velo del Templo se rasga, y al pie de la Cruz, María es entregada como Madre a Juan.",
            "scripture_primary": "Luke 23:33-46",
            "scripture_secondary": "Philippians 2:8",
            "fruit": "Perdón de los Enemigos",
            "fruit_explanation": "El fruto es la capacidad de amar y perdonar a quienes nos han ofendido, imitando la primera palabra de Jesús en la Cruz: 'Padre, perdónales, porque no saben lo que hacen'.",
            "life_application": "Perdonar activamente a los demás y buscar el arrepentimiento profundo por los propios pecados. Refugiarse en María como la Madre que nos fue dada al morir Cristo.",
            "meditation": "Contemplar la entrega total de Cristo: Su muerte y la efusión de Su sangre. Meditar las Siete Palabras. Pedir la gracia de morir al pecado y vivir solo para Él.",
            "deeper_theology": "**La Consumación del Sacrificio**. La muerte de Cristo paga la deuda del pecado original. El rasgar del velo simboliza el fin de la Antigua Alianza. La entrega de María a Juan establece Su **Maternidad Universal** sobre la Iglesia.[4]",
            "historical_context": "El Gólgota (La Calavera) era el lugar de ejecución pública. La crucifixión era la pena capital más dolorosa y vergonzosa impuesta por Roma.",
            "mary_and_christ_role": "Cristo es el Cordero de Dios inmolado. María está de pie junto a la Cruz, sufriendo el dolor como Corredentora y recibiendo la misión de ser Madre de la humanidad.",
            "virtue_formation": "Arrepentimiento Profundo"
        },
        {
            "mystery_name": "Misterios Gloriosos",
            "mystery_number": 1,
            "title": "Fundamento de la Fe y Victoria sobre la Muerte",
            "meaning": "Al tercer día, Cristo resucita de entre los muertos, cumpliendo las Escrituras. Su resurrección es el milagro que verifica Su divinidad y la promesa de nuestra propia resurrección y vida eterna.",
            "scripture_primary": "Matthew 28:1-10",
            "scripture_secondary": "1 Corinthians 15:20",
            "fruit": "Fe",
            "fruit_explanation": "La Fe es la convicción de la realidad invisible de Dios y de Su poder. Es la certeza de que Cristo es el Vencedor sobre el pecado y la muerte.[5]",
            "life_application": "Combatir la *acedia* (cansancio espiritual) y el desánimo. Vivir con la convicción de la victoria de Cristo, sabiendo que 'quien no adelanta en la vida espiritual, retrocede'.[6]",
            "meditation": "Contemplar el sepulcro vacío y la alegría de los apóstoles. Meditar sobre la Resurrección como el centro de la fe. Pedir una esperanza firme y la perseverancia, encontrando refugio en el Corazón de María.[6]",
            "deeper_theology": "El **Misterio Pascual**. La Resurrección es el acto que justifica la Pasión y abre el camino a la vida eterna. Es el cumplimiento de la promesa de que no pereceremos si nos encomendamos a María.",
            "historical_context": "Las apariciones a María Magdalena y a los discípulos de Emaús. El contexto es el miedo y la incredulidad inicial, transformados por la evidencia de la vida nueva.",
            "mary_and_christ_role": "Cristo es el Resucitado. María es la primera en creer en la Resurrección, y Su Corazón Inmaculado es el 'salvavidas' contra la condenación eterna del alma.[6]",
            "virtue_formation": "Perseverancia contra la Acedia"
        },
        {
            "mystery_name": "Misterios Gloriosos",
            "mystery_number": 2,
            "title": "Intercesión Sacerdotal y Destino Final",
            "meaning": "Cuarenta días después de Su Resurrección, Jesús asciende al cielo en presencia de Sus discípulos, donde se sienta a la diestra del Padre, intercediendo continuamente por la humanidad.",
            "scripture_primary": "Acts 1:6-11",
            "scripture_secondary": "John 14:2-3",
            "fruit": "Esperanza",
            "fruit_explanation": "La Esperanza es la virtud teologal que nos da la certeza de que Cristo ha preparado un lugar para nosotros en la Patria celestial, y nos impulsa a buscar la santidad.",
            "life_application": "Vivir con el **Desapego Terrenal**, considerando el Cielo como la 'obsesión y preocupación principal'. Dirigir todas las acciones, palabras y pensamientos hacia la vida eterna.",
            "meditation": "Contemplar a Cristo entrando en Su gloria y mediando por nosotros. Reflexionar sobre nuestra meta y pedir la gracia de la santidad, recordando que Jesús subió para preparar un lugar.",
            "deeper_theology": "La **Mediación Sacerdotal de Cristo**. Jesús asume Su lugar como Sacerdote Eterno ante el Padre. El misterio es el final de Su presencia física terrenal y el inicio de Su presencia sacramental.",
            "historical_context": "La Ascensión ocurre en el Monte de los Olivos, marcando el fin del periodo de Sus apariciones post-resurrección y la promesa del retorno glorioso.",
            "mary_and_christ_role": "Cristo entra en la gloria para interceder por nosotros. María es el ejemplo de la fe que espera el cumplimiento de la promesa y dirige Su mirada hacia el Cielo, la meta final.",
            "virtue_formation": "Desapego Terrenal"
        },
        {
            "mystery_name": "Misterios Gloriosos",
            "mystery_number": 3,
            "title": "Nacimiento de la Iglesia y Celó Apostólico",
            "meaning": "Diez días después de la Ascensión, el Espíritu Santo desciende sobre la Virgen María y los Apóstoles reunidos en el Cenáculo, dotándolos de dones y lenguas de fuego para iniciar la predicación del Evangelio.",
            "scripture_primary": "Acts 2:1-4",
            "scripture_secondary": "Joel 2:28-29",
            "fruit": "Sabiduría",
            "fruit_explanation": "La Sabiduría es el don que nos permite ver las cosas desde la perspectiva de Dios. Nos da el entendimiento para el apostolado y para la defensa de la doctrina.[5]",
            "life_application": "Fomentar el **Celó Apostólico**, predicando la doctrina católica sin temer las burlas. Buscar activamente la exaltación pública y el triunfo de la Virgen María como mediadora de todas las gracias.",
            "meditation": "Contemplar la fuerza y el cambio de los Apóstoles tras recibir el Espíritu Santo. Meditar la presencia de María, la Esposa del Espíritu Santo, en este momento fundacional. Pedir los siete dones del Espíritu.",
            "deeper_theology": "La **Mediación Mariana del Espíritu**. Dios quiere otorgar Sus gracias a través del Corazón Inmaculado de María. Pentecostés es el nacimiento público de la Iglesia, con María como su Madre y modelo.",
            "historical_context": "El evento ocurre durante la fiesta judía de las Semanas (Pentecostés). Marca la transición de la promesa de Cristo a la acción de la Iglesia en el mundo.",
            "mary_and_christ_role": "Cristo envía al Paráclito prometido. María es el canal a través del cual el Espíritu Santo se derrama sobre la Iglesia, siendo el Corazón Inmaculado el medio por el cual Dios otorga Sus gracias.",
            "virtue_formation": "Celó Apostólico"
        },
        {
            "mystery_name": "Misterios Gloriosos",
            "mystery_number": 4,
            "title": "Primicia de la Glorificación Corporal",
            "meaning": "La Virgen María, al final de Su vida terrena, fue llevada en cuerpo y alma a la gloria del Cielo. Este misterio nos consuela y es la garantía de la resurrección de nuestros propios cuerpos al final de los tiempos.",
            "scripture_primary": "Revelation 12:1",
            "scripture_secondary": "Luke 1:48-49",
            "fruit": "Devoción a María",
            "fruit_explanation": "La Devoción a María es el amor filial que busca la unión de nuestro corazón al Corazón Inmaculado de María y al Sagrado Corazón de Jesús.[5]",
            "life_application": "Encontrar **consuelo** en la presencia de María en el Cielo, sabiendo que Ella 'nos espera y vela sobre nosotros' desde la 'Patria celestial'. Buscar Su intercesión y refugio en las pruebas.",
            "meditation": "Contemplar la gloria de María, más 'brillante que el sol'. Meditar sobre la vocación de nuestro propio cuerpo a la resurrección y la vida eterna. Pedir la gracia de honrar a María con un amor puro.",
            "deeper_theology": "**Primicia Escatológica y Dogma (1950)**. María es el modelo de la Iglesia perfecta. Su Asunción corporal es un anticipo de la glorificación final que espera a todos los redimidos.",
            "historical_context": "La Asunción fue un dogma largamente creído en la tradición, formalmente definido por el Papa Pío XII en 1950. Los videntes de Fátima la vieron gloriosa, reforzando Su presencia celestial.",
            "mary_and_christ_role": "Cristo glorifica a Su Madre. María es el signo de la esperanza y la consolación en el 'valle de lágrimas'.",
            "virtue_formation": "Amor Filial"
        },
        {
            "mystery_name": "Misterios Gloriosos",
            "mystery_number": 5,
            "title": "El Triunfo del Corazón Inmaculado",
            "meaning": "La Virgen María es coronada por la Santísima Trinidad como Reina de todo lo creado: del Cielo, de la Tierra y de los Ángeles. Este misterio proclama Su realeza universal.",
            "scripture_primary": "Revelation 12:1-2",
            "scripture_secondary": "Judith 15:9",
            "fruit": "Gracia de una Muerte Feliz",
            "fruit_explanation": "Este fruto es la gracia final de la perseverancia y la certeza de la salvación en la hora de la muerte, asegurada por la intercesión de la Reina del Cielo.",
            "life_application": "Colaborar activamente en la extensión del Reino de Cristo a través de María, buscando la glorificación universal de los Dos Corazones unidos. Trabajar por el 'triunfo del Corazón Inmaculado'.",
            "meditation": "Contemplar la gloria final de la Madre de Dios. Meditar la certeza: '¡Al final, mi Corazón Inmaculado triunfará!'. Pedir la gracia de una muerte santa y la intercesión de María en ese momento final.",
            "deeper_theology": "**El Triunfo Final del Corazón Inmaculado**. Dios ha dispuesto que María sea la Mediadora Universal. Su Coronación garantiza Su poder intercesor y Su rol como instrumento de salvación para las almas.",
            "historical_context": "La realeza de María ha sido afirmada constantemente en la liturgia y la piedad popular. Se conecta con las promesas de Fátima sobre la consagración y el triunfo final de Su Corazón.",
            "mary_and_christ_role": "Cristo, el Rey, corona a Su Madre. María ejerce Su realeza como Mediadora y protectora, siendo el camino que Dios ha escogido para otorgar todas las gracias y conducirnos a Jesús.",
            "virtue_formation": "Colaboración en el Triunfo"
        }
    ]
}